O dataset abaixo armazena informações do campeonato brasileiro de futebol, série A, entre 2017 a 2019. Com base nestes dados responda:


qual a média de pontos de cada time entre 2017-2019?


qual a pontuação máxima e mínima por ano?


qual a média de pontos por ano, dentre todos os times selecionados?


quantos times estiveram no Top 5 em cada ano?


obtenha estatísticas descritivas da pontuação para cada time (média, máximo, mínimo, desvio padrão, mediana), para o recorte temporal estabelecido.


Use a função groupby().


https://prnt.sc/EjczQbOmOXNV

In [5]:
import pandas as pd
import numpy as np

In [2]:
dados = {'Pontos': [56, 74, 63, 63, 72, 50, 63, 44, 80],
         'Rank': [8, 3, 6, 2, 1, 13, 5, 13, 1],
         'Ano': [2019,2019,2019,2017,2017,2017,2018,2018,2018],
         'Time': ['Corinthians', 'Palmeiras', 'São Paulo', 'Palmeiras', 'Corinthians', 'São Paulo', 'São Paulo', 'Corinthians', 'Palmeiras']
         }

df = pd.DataFrame(dados)
df

   Pontos  Rank   Ano         Time
0      56     8  2019  Corinthians
1      74     3  2019    Palmeiras
2      63     6  2019    São Paulo
3      63     2  2017    Palmeiras
4      72     1  2017  Corinthians
5      50    13  2017    São Paulo
6      63     5  2018    São Paulo
7      44    13  2018  Corinthians
8      80     1  2018    Palmeiras

In [4]:
df.groupby('Time')['Pontos'].mean().round(2)

Time
Corinthians    57.33
Palmeiras      72.33
São Paulo      58.67
Name: Pontos, dtype: float64

In [6]:
df.groupby('Ano')[['Pontos']].agg([np.min, np.max])

     Pontos
       amin amax
Ano
2017     50   72
2018     44   80
2019     56   74

In [7]:
df.groupby('Ano')[['Pontos']].mean().round(2)

      Pontos
Ano
2017   61.67
2018   62.33
2019   64.33

In [8]:
df[df['Rank'] <= 5].groupby('Ano')['Time'].count()

Ano
2017    2
2018    2
2019    1
Name: Time, dtype: int64

In [9]:
df.groupby('Time')['Pontos'].agg([np.mean, np.std, np.var, np.median])

                  mean        std         var  median
Time
Corinthians  57.333333  14.047538  197.333333    56.0
Palmeiras    72.333333   8.621678   74.333333    74.0
São Paulo    58.666667   7.505553   56.333333    63.0